Repository: maqa588/Strophe
Catalog: Strophe/App/Localizable.xcstrings
Source language: en
Languages: ar, ja, ko, zh_hans, zh_hant

source: Import File…
ar: استيراد ملف…
ja: ファイルをインポート…
ko: 파일 가져오기…
zh_hans: 导入文件…
zh_hant: 匯入檔案…

# import_media_ellipsis
source: Import Media…
ar: استيراد وسائط…
ja: メディアをインポート…
ko: 미디어 가져오기…
zh_hans: 导入媒体…
zh_hant: 匯入媒體…

source: Import model from local folder...
ar: استيراد النموذج من المجلد المحلي...
ja: ローカルフォルダからモデルをインポート...
ko: 로컬 폴더에서 모델 가져오기...
zh_hans: 从本地文件夹导入模型...
zh_hant: 從本地資料夾匯入模型...

source: Import Script
ar: استيراد النص
ja: スクリプトをインポート
ko: 스크립트 가져오기
zh_hans: 导入文稿
zh_hant: 匯入文稿

# import_script_1
source: Import Script
ar: استيراد النص
ja: スクリプトをインポート
ko: 스크립트 가져오기
zh_hans: 导入脚本
zh_hant: 匯入指令碼

# import_script_ellipsis
source: Import Script…
ar: استيراد النص…
ja: スクリプトをインポート…
ko: 스크립트 가져오기…
zh_hans: 导入文稿…
zh_hant: 匯入文稿…

source: Import Subtitle File
ar: استيراد ملف ترجمة
ja: 字幕ファイルをインポート
ko: 자막 파일 가져오기
zh_hans: 导入字幕文件
zh_hant: 匯入字幕檔案

# import_subtitle_file_ellipsis
source: Import Subtitle File…
ar: استيراد ملف الترجمة…
ja: 字幕ファイルをインポート…
ko: 자막 파일 가져오기…
zh_hans: 导入字幕文件…
zh_hant: 匯入字幕檔案…

# importing_this_project_file_will
source: Importing this project file will overwrite the subtitles you are currently editing.
ar: سيؤدي استيراد ملف المشروع هذا إلى الكتابة فوق الترجمة التي تقوم بتحريرها حاليًا.
ja: このプロジェクトファイルをインポートすると、現在編集中の字幕が上書きされます。
ko: 이 프로젝트 파일을 가져오면 현재 편집 중인 자막을 덮어씁니다.
zh_hans: 导入该工程文件将覆盖你当前正在编辑的字幕。
zh_hant: 匯入此工程檔案將覆蓋您目前正在編輯的字幕。

# input_query_word
source: Input word to query
ar: أدخل الكلمة للاستعلام
ja: クエリする単語を入力してください
ko: 조회할 단어를 입력하십시오
zh_hans: 输入要查询的词
zh_hant: 輸入要查詢的詞

source: Italic
ar: مائل
ja: 斜体
ko: 이탤릭체
zh_hans: 斜体
zh_hant: 斜體

# jump_to_last_position_confirm
source: The project saves the last timeline position. Do you want to jump to it?
ar: يحفظ ملف المشروع موضع الخط الزمني الأخير. هل تريد الانتقال إليه؟
ja: プロジェクトファイルは最後のタイムライン位置を保存しています。そこに移動しますか？
ko: 이 프로젝트는 마지막 타임라인 위치를 저장했습니다. 해당 위치로 이동할까요?
zh_hans: 该工程文件保存了上一次的时间轴位置，是否要跳转到该位置？
zh_hant: 該工程檔案儲存了上一次的時間軸位置，是否要跳轉到該位置？

# label_edited
source: — Edited
ar: — معدل
ja: — 編集済み
ko: — 편집됨
zh_hans: — 已编辑
zh_hant: — 已編輯

source: Language
ar: اللغة
ja: 言語
ko: 언어
zh_hans: 语言
zh_hant: 語言

source: Language Config
ar: تكوين اللغة
ja: 言語構成
ko: 언어 설정
zh_hans: 语言配置
zh_hant: 語言配置

source: Language Processing
ar: معالجة اللغة
ja: 言語処理
ko: 언어 처리
zh_hans: 语言处理
zh_hant: 語言處理

source: Language Type
ar: نوع اللغة
ja: 言語タイプ
ko: 언어 유형
zh_hans: 语言类型
zh_hant: 語言類型

source: Left Half
ar: النصف الأيسر
ja: 左半分
ko: 좌측 절반
zh_hans: 左半
zh_hant: 左半

source: License
ar: الترخيص
ja: ライセンス
ko: 라이선스
zh_hans: 许可证
zh_hant: 許可證

# license_fsl
source: Functional Source License
ar: ترخيص المصدر الوظيفي
ja: 機能的ソースライセンス
ko: 기능적 소스 라이선스
zh_hans: 功能性源码许可证 (FSL)
zh_hant: 功能性源碼許可證 (FSL)

source: Line Break Method
ar: طريقة تفريق الأسطر
ja: 改行方法
ko: 줄바꿈 방식
zh_hans: 换行方式
zh_hant: 換行方式

# loading_subtitles_waveform
source: Loading subtitles, rebuilding timeline index, and preparing waveform
ar: تحميل الترجمات، وإعادة بناء مؤشر الخط الزمني، وتحضير الشكل الموجي
ja: 字幕を読み込み、タイムラインインデックスを再構築し、波形を準備しています
ko: 자막을 로드하고 타임라인 인덱스를 재구축하며 파형을 준비 중입니다
zh_hans: 正在读取字幕、重建时间轴索引并准备波形
zh_hant: 正在讀取字幕、重建時間軸索引並準備波形

source: Local
ar: محلي
ja: ローカル
ko: 로컬
zh_hans: 本地
zh_hant: 本地

# local_ai_speech_timing
source: Local AI Speech Recognition Timing
ar: مزامنة الكلام بالذكاء الاصطناعي المحلي
ja: ローカルAI音声認識タイミング
ko: 로컬 AI 음성 인식 정렬
zh_hans: 本地 AI 语音识别打轴
zh_hant: 本地 AI 語音識別打軸

source: Local Generate Subtitles
ar: إنشاء ترجمات محلية
ja: ローカルで字幕生成
ko: 로컬 자막 생성
zh_hans: 本地生成字幕
zh_hant: 本地生成字幕

source: Local Manual Import
ar: استيراد يدوي محلي
ja: ローカル手動インポート
ko: 로컬 수동 가져오기
zh_hans: 本地手动导入
zh_hant: 本地手動匯入

source: Local Recognition
ar: تعرف محلي
ja: ローカル認識
ko: 로컬 인식
zh_hans: 本地识别
zh_hant: 本地識別

source: Local Speech Recognition Config
ar: تكوين التعرف على الكلام المحلي
ja: ローカル音声認識構成
ko: 로컬 음성 인식 설정
zh_hans: 本地语音识别配置
zh_hant: 本地語音識別配置

source: Lock this group
ar: قفل هذه المجموعة
ja: このグループをロック
ko: 이 그룹 잠금
zh_hans: 锁定此组
zh_hant: 鎖定此組

source: Machine Translation Service
ar: خدمة الترجمة الآلية
ja: 機械翻訳サービス
ko: 기계 번역 서비스
zh_hans: 机器翻译服务
zh_hant: 機器翻譯服務

source: Mark
ar: علامة
ja: マーク
ko: 표시
zh_hans: 标记
zh_hant: 標記

source: Mark Time
ar: تحديد الوقت
ja: 時間をマーク
ko: 시간 표시
zh_hans: 标记时间
zh_hant: 標記時間

source: Max Length
ar: أقصى طول
ja: 最大長
ko: 최대 길이
zh_hans: 最大长度
zh_hant: 最大長度

source: Media Not Found
ar: الوسائط غير موجودة
ja: メディアが見つかりません
ko: 미디어를 찾을 수 없음
zh_hans: 媒体未找到
zh_hant: 媒體未找到

source: Media Required
ar: الوسائط مطلوبة
ja: メディアが必要です
ko: 미디어가 필요합니다
zh_hans: 需要媒体
zh_hant: 需要媒體

# menu_about
source: About
ar: حول
ja: バージョン情報
ko: 정보
zh_hans: 关于
zh_hant: 關於

# menu_redo
source: Redo
ar: إعادة
ja: やり直す
ko: 다시 실행
zh_hans: 重做
zh_hant: 重做

# menu_undo
source: Undo
ar: تراجع
ja: 元に戻す
ko: 실행 취소
zh_hans: 撤销
zh_hant: 撤銷

source: Merge Subtitles
ar: دمج الترجمات
ja: 字幕結合
ko: 자막 병합
zh_hans: 合并字幕
zh_hant: 合併字幕

# merge_the_selected_consecutive_subtitle
source: Merge the selected consecutive subtitle blocks into one, combining both text and timeline
ar: دمج كتل الترجمة المتتالية المحددة في كتلة واحدة، مع دمج النص والجدول الزمني معًا
ja: 選択した連続する字幕ブロックを1つに結合し、テキストとタイムラインを同時に結合します
ko: 선택한 연속 자막 블록을 하나로 병합하여 텍스트와 타임라인을 동시에 병합합니다
zh_hans: 将选中的连续字幕块合并为一个，文本与时间轴同时合并
zh_hant: 將選中的連續字幕塊合併為一個，文字與時間軸同時合併

source: Model
ar: النموذج
ja: モデル
ko: 모델
zh_hans: 模型
zh_hant: 模型

source: Model Selection
ar: اختيار النموذج
ja: モデル選択
ko: 모델 선택
zh_hans: 模型选择
zh_hant: 模型選擇

source: Model Storage Location
ar: موقع تخزين النموذج
ja: モデル保存場所
ko: 모델 저장 위치
zh_hans: 模型存储位置
zh_hant: 模型儲存位置

source: Modify Default Style
ar: تعديل النمط الافتراضي
ja: デフォルトスタイルを変更
ko: 기본 스타일 수정
zh_hans: 修改默认样式
zh_hant: 修改預設樣式

source: Monospace
ar: أحادية المسافة
ja: 等幅
ko: 고정폭
zh_hans: 等宽
zh_hant: 等寬

source: Move Subtitle Block
ar: نقل كتلة الترجمة
ja: 字幕ブロックを移動
ko: 자막 블록 이동
zh_hans: 移动字幕块
zh_hant: 移動字幕區塊

source: Move Subtitle Block to Group
ar: نقل كتلة الترجمة إلى مجموعة
ja: 字幕ブロックをグループに移動
ko: 자막 블록을 그룹으로 이동
zh_hans: 移动字幕块到分组
zh_hant: 移動字幕塊到分組

source: Move to Group
ar: نقل إلى المجموعة
ja: グループに移動
ko: 그룹으로 이동
zh_hans: 移动到分组
zh_hant: 移動到分組

source: Multi-select Subtitle Blocks
ar: تحديد كتل ترجمة متعددة
ja: 字幕ブロックの複数選択
ko: 자막 블록 다중 선택
zh_hans: 多选字幕块
zh_hant: 多選字幕塊

# multipass_videotoolbox_explanation
source: Default off. VideoToolbox analyzes multiple passes for low-motion or target bitrates.
ar: إيقاف افتراضي. يقوم VideoToolbox بتحليل تمريرات متعددة للحركات المنخفضة أو معدلات البت المستهدفة.
ja: デフォルトはオフ。VideoToolboxは低モーションまたはターゲットビットレートのためにマルチパス分析を行います。
ko: 기본값은 비활성화. VideoToolbox는 저움직임 또는 대상 비트레이트를 위해 멀티패스 분석을 수행합니다.
zh_hans: 默认关闭。开启后会让 VideoToolbox 在支持时进行多遍分析，导出更慢，但低运动画面和目标码率模式通常更容易压出更小体积。
zh_hant: 預設關閉。開啟後會讓 VideoToolbox 在支援時進行多遍分析，匯出更慢，但低運動畫面和目標碼率模式通常更容易壓出更小體積。

source: Name
ar: الاسم
ja: 名前
ko: 이름
zh_hans: 名称
zh_hant: 名稱

source: New Group
ar: مجموعة جديدة
ja: 新規グループ
ko: 새 그룹
zh_hans: 新建分组
zh_hant: 新建分組

source: New Project
ar: مشروع جديد
ja: 新規プロジェクト
ko: 새 프로젝트
zh_hans: 新建工程
zh_hant: 新建工程

# new_project_confirm
source: Create a new project?
ar: إنشاء مشروع جديد؟
ja: 新規プロジェクトを作成しますか？
ko: 새 프로젝트를 생성할까요?
zh_hans: 是否新建工程？
zh_hant: 是否新建工程？

# new_project_warning
source: Creating a new project clears current media, subtitles, and edits.
ar: يؤدي إنشاء مشروع جديد إلى مسح الوسائط والترجمات والتعديلات الحالية.
ja: 新規プロジェクトを作成すると、現在のビデオ、字幕、編集がクリアされます。
ko: 새 프로젝트를 생성하면 현재 비디오, 자막 및 편집 내용이 지워집니다.
zh_hans: 新建工程会清空当前视频、字幕和未保存的修改。
zh_hant: 新建工程會清空當前視訊、字幕和未儲存的修改。

source: New Style
ar: نمط جديد
ja: 新規スタイル
ko: 새 스타일
zh_hans: 新建样式
zh_hant: 新建樣式

source: New Subtitle Project
ar: مشروع ترجمة جديد
ja: 新規字幕プロジェクト
ko: 새 자막 프로젝트
zh_hans: 新建字幕项目
zh_hant: 新建字幕專案

source: No matching fonts found
ar: لم يتم العثور على خطوط مطابقة
ja: 一致するフォントが見つかりません
ko: 일치하는 글꼴을 찾을 수 없음
zh_hans: 没有找到符合条件的字体
zh_hant: 沒有找到符合條件的字型

source: No Media
ar: لا توجد وسائط
ja: メディアなし
ko: 미디어 없음
zh_hans: 未加载媒体
zh_hant: 未載入媒體

source: No Media Loaded
ar: لم يتم تحميل وسائط
ja: メディアが読み込まれていません
ko: 미디어가 로드되지 않았습니다
zh_hans: 未加载媒体
zh_hant: 未載入媒體

# no_media_loaded_1
source: No Media Loaded
ar: لم يتم تحميل وسائط
ja: メディアが読み込まれていません
ko: 미디어가 로드되지 않았습니다
zh_hans: 未加载媒体
zh_hant: 未載入媒體

# no_original_subtitles_in_group
source: No original subtitles in this group
ar: لا توجد ترجمات أصلية في هذه المجموعة
ja: このグループに原文の字幕はありません
ko: 이 그룹에 원본 자막이 없습니다
zh_hans: 该小组没有原文字幕
zh_hant: 該小組沒有原文字幕

source: No Recent Projects
ar: لا توجد مشاريع حديثة
ja: 最近のプロジェクトはありません
ko: 최근 프로젝트 없음
zh_hans: 暂无最近项目
zh_hant: 暫無最近專案

source: No Script
ar: لا يوجد نص
ja: スクリプトなし
ko: 스크립트 없음
zh_hans: 未加载文稿
zh_hant: 未載入文稿

# no_subtitle_block_at_playhead
source: No subtitle block at playhead position
ar: لا توجد كتلة ترجمة عند موضع مؤشر الوقت
ja: 時間再生ヘッドの位置に字幕ブロックがありません
ko: 재생 헤드 위치에 자막 블록이 없습니다
zh_hans: 时间游标位置没有字幕块
zh_hant: 時間遊標位置沒有字幕塊

source: Noisy Vocals (Smart Noise Reduction)
ar: صوت بشري صاخب (تقليل الضوضاء الذكي)
ja: 騒がしいボーカル (インテリジェントノイズ低減)
ko: 시끄러운 보컬 (스마트 노이즈 감소)
zh_hans: 嘈杂人声 (智能降噪)
zh_hant: 嘈雜人聲 (智能降噪)

# note_clearing_cache_is_completely
source: Note: Clearing cache is completely safe. It will never delete your subtitle document projects, saved project files, or original audio/video source files.
ar: ملاحظة: مسح ذاكرة التخزين المؤقت آمن تمامًا، فلن يحذف أبدًا مشاريع مستندات الترجمة الخاصة بك أو ملفات المشروع المحفوظة أو ملفات الصوت والفيديو الأصلية.
ja: 注意：キャッシュのクリーンアップは完全に安全です。字幕ドキュメントプロジェクト、保存されたプロジェクトファイル、または元の音声/ビデオソースファイルを削除することは決してありません。
ko: 참고: 캐시 정리 작업은 완전히 안전합니다. 자막 문서 프로젝트, 저장된 프로젝트 파일 또는 원본 오디오/비디오 소스 파일은 삭제되지 않습니다.
zh_hans: 提示：清理缓存是完全安全的，它绝不会删除您的字幕文稿项目、已保存的工程文件或原始音视频源文件。
zh_hant: 提示：清理快取是完全安全的，它絕不會刪除您的字幕文稿專案、已儲存的工程檔案或原始音音訊來源檔案。

# note_this_model_has_not
source: Note: This model has not been downloaded yet. It will be downloaded automatically from Hugging Face when generation starts.
ar: ملاحظة: هذا النموذج لم يتم تنزيله بعد، وسيتم تنزيله تلقائيًا من Hugging Face عند بدء التوليد.
ja: 注意：このモデルはまだダウンロードされていません。生成開始時に Hugging Face から自動的にダウンロードされます。
ko: 참고: 이 모델은 아직 다운로드되지 않았습니다. 생성이 시작될 때 Hugging Face에서 자동으로 다운로드됩니다.
zh_hans: 提示：此模型尚未下载，开始生成时会从 Hugging Face 自动下载该模型。
zh_hant: 提示：此模型尚未下載，開始生成時會從 Hugging Face 自動下載該模型。

source: Number of Speakers
ar: عدد المتحدثين
ja: 話者数
ko: 화자 수
zh_hans: 发言人数
zh_hant: 發言人數

source: NV12 Pixel Buffer
ar: مخزن بكسل NV12
ja: NV12ピクセルバッファ
ko: NV12 픽셀 버퍼
zh_hans: NV12 像素缓冲
zh_hant: NV12 像素緩衝

source: OK
ar: موافق
ko: 확인
zh_hans: 好
zh_hant: 好

# ok_1
source: OK
ar: موافق
ko: 확인
zh_hans: 确定
zh_hant: 確定

# ollama_connection_info
source: Ollama connects to localhost by default, no API key needed.
ar: يتصل Ollama بالخدمة المحلية بشكل افتراضي، ولا يلزم مفتاح API.
ja: Ollamaはデフォルトでローカルサービスに接続するため、APIキーは不要です。
ko: Ollama는 기본적으로 로컬 서비스에 연결되므로 API 키가 필요하지 않습니다.
zh_hans: Ollama 默认连接本机服务，不需要 API 密钥。
zh_hant: Ollama 預設連接本機服務，不需要 API 金鑰。

source: Open
ar: فتح
ja: 開く
ko: 열기
zh_hans: 打开
zh_hant: 開啟

# open_new_video_warning
source: Opening a new video discards current project. Please save first.
ar: يؤدي فتح فيديو جديد إلى تجاهل المشروع الحالي. يرجى الحفظ أولاً.
ja: 新しいビデオを開くと現在のプロジェクトが破棄されます。まず保存してください。
ko: 새 비디오를 열면 현재 프로젝트가 삭제됩니다. 먼저 저장하십시오.
zh_hans: 打开新视频会丢弃当前工程，并新建一个与视频文件同名的工程缓存。如果当前工程还没有保存，请先检查保存情况。
zh_hant: 開啟新視訊會丟棄當前工程，並新建一個與視訊檔案同名的工程快取。如果當前工程還沒有儲存，請先檢查儲存情況。

# open_save_project_hint
source: Projects will be displayed here after opening or saving.
ar: سيتم عرض المشاريع هنا بعد فتحها أو حفظها.
ja: 開いた、または保存したプロジェクトがここに表示されます。
ko: 열거나 저장한 프로젝트가 여기에 표시됩니다.
zh_hans: 打开或保存 .strophe 工程后会显示在这里。
zh_hant: 開啟或儲存 .strophe 工程後會顯示在這裡。

source: Open Strophe Project
ar: فتح مشروع Strophe
ja: Stropheプロジェクトを開く
ko: Strophe 프로젝트 열기
zh_hans: 打开 Strophe 工程
zh_hant: 開啟 Strophe 工程

# open_strophe_project_ellipsis
source: Open Strophe Project…
ar: فتح مشروع Strophe…
ja: Stropheプロジェクトを開く…
ko: Strophe 프로젝트 열기…
zh_hans: 打开 Strophe 工程…
zh_hant: 開啟 Strophe 工程…

# open_subtitle_translator_ellipsis
source: Open Subtitle Translator…
ar: فتح مترجم الترجمة…
ja: 字幕翻訳機を開く…
ko: 자막 번역기 열기…
zh_hans: 打开字幕翻译器…
zh_hant: 開啟字幕翻譯器…

source: Open Video / Audio
ar: فتح فيديو / صوت
ja: ビデオ/オーディオを開く
ko: 비디오/오디오 열기
zh_hans: 打开视频 / 音频
zh_hant: 開啟視訊 / 音訊

source: Opening Project
ar: فتح المشروع
ja: プロジェクトを開いています
ko: 프로젝트 여는 중
zh_hans: 正在打开项目
zh_hant: 正在開啟專案

source: Operation Cannot Be Completed
ar: لا يمكن إكمال العملية
ja: 操作を完了できません
ko: 작업을 완료할 수 없음
zh_hans: 无法完成操作
zh_hant: 無法完成操作

source: Original Text
ar: النص الأصلي
ja: 原文
ko: 원본 텍스트
zh_hans: 原文
zh_hant: 原文

source: Original Text Group
ar: مجموعة النص الأصلي
ja: 原文グループ
ko: 원본 텍스트 그룹
zh_hans: 原文小组
zh_hant: 原文小組

source: Output by Aspect Ratio
ar: إخراج بنسبة العرض للشاشة
ja: ディスプレイ比率で出力
ko: 화면 비율로 출력
zh_hans: 按显示比例输出
zh_hant: 按顯示比例輸出

source: Output Format
ar: تنسيق المخرجات
ja: 出力形式
ko: 출력 형식
zh_hans: 输出格式
zh_hant: 輸出格式

source: Overwrite
ar: استبدال
ja: 上書き
ko: 덮어쓰기
zh_hans: 覆盖
zh_hant: 覆蓋

source: Overwrite existing subtitles?
ar: هل تريد الكتابة فوق الترجمة الحالية؟
ja: 既存の字幕を上書きしますか？
ko: 기존 자막을 덮어쓰시겠습니까?
zh_hans: 是否覆盖现有字幕？
zh_hant: 是否覆蓋現有字幕？

source: Paste or Import Script
ar: لصق أو استيراد النص
ja: スクリプトを貼り付けまたはインポート
ko: 스크립트 붙여넣기 또는 가져오기
zh_hans: 粘贴或导入文稿
zh_hant: 貼上或匯入文稿

source: Paste Script
ar: لصق النص
ja: スクリプトを貼り付け
ko: 스크립트 붙여넣기
zh_hans: 粘贴文稿
zh_hant: 貼上文稿

# paste_script_instructions
source: Paste your script below. Each line becomes one subtitle segment.
ar: ألصق النص أدناه. كل سطر يصبح مقطع ترجمة واحد.
ja: 以下にスクリプトを貼り付けてください。各行が1つの字幕セグメントになります。
ko: 아래에 스크립트를 붙여넣으세요. 각 줄이 하나의 자막 세그먼트가 됩니다.
zh_hans: 在下方粘贴您的文稿。每一行将生成一段字幕。
zh_hant: 在下方貼上您的文稿。每一行將生成一段字幕。

source: Paste Script Text
ar: لصق نص السيناريو
ja: スクリプトテキストを貼り付け
ko: 스크립트 텍스트 붙여넣기
zh_hans: 粘贴文稿文本
zh_hant: 貼上文稿文字

# paste_script_to_start
source: Paste your script to start marking timestamps.
ar: ألصق النص للبدء في وضع الطوابع الزمنية.
ja: スクリプトを貼り付けてタイムスタンプの作成を開始します。
ko: 스크립트를 붙여넣어 타임스탬프 표시를 시작하세요.
zh_hans: 粘贴您的文稿以开始标记时间轴。
zh_hant: 貼上您的文稿以開始標記時間軸。

source: Paste Subtitle Block
ar: لصق كتلة الترجمة
ja: 字幕ブロックを貼り付け
ko: 자막 블록 붙여넣기
zh_hans: 粘贴字幕块
zh_hant: 貼上字幕塊

# please_import_a_video_or
source: Please import a video or audio file before using speech recognition.
ar: يرجى استيراد ملف فيديو أو صوت أولاً قبل استخدام ميزة التعرف على الكلام.
ja: 音声認識機能を使用する前に、まずビデオまたはオーディオファイルをインポートしてください。
ko: 음성 인식 기능을 사용하려면 먼저 비디오 또는 오디오 파일을 가져오십시오.
zh_hans: 请先导入视频或音频文件再使用语音识别功能。
zh_hant: 請先匯入影片或音訊檔案再使用語音識別功能。

# please_resolve_overlap_issues_before
source: Please resolve overlap issues before splitting
ar: يرجى حل مشكلات التداخل أولاً قبل التقسيم
ja: 分割する前にまず重複の問題を解決してください
ko: 분할하기 전에 먼저 겹침 문제를 해결하십시오
zh_hans: 请先解决重叠问题再拆分
zh_hant: 請先解決重疊問題再拆分

# please_select_at_least_two
source: Please select at least two subtitle blocks to merge
ar: يرجى تحديد كتلتين من الترجمات على الأقل للدمج
ja: 結合するには少なくとも2つの字幕ブロックを選択してください
ko: 병합하려면 최소 두 개의 자막 블록을 선택하십시오
zh_hans: 请至少选中两个字幕块才能合并
zh_hant: 請至少選中兩個字幕塊才能合併

# position_sync_explanation
source: Position syncs for both preview and hard subtitle burn-in
ar: تتم مزامنة الموضع للمعاينة وحرق الترجمة
ja: プレビューとハード字幕焼き付けの両方に位置を同期します
ko: 미리보기 및 하드 자막 굽기 모두에 위치를 동기화합니다
zh_hans: 位置会同步用于播放器预览和硬字幕烧录
zh_hant: 位置會同步用於播放器預覽和硬字幕燒錄

source: Preprocessing
ar: معالجة أولية
ja: 前処理
ko: 전처리
zh_hans: 预处理
zh_hant: 預處理

source: Preview Text
ar: نص المعاينة
ja: プレビューテキスト
ko: 미리보기 텍스트
zh_hans: 预览文本
zh_hant: 預覽文字

source: Previous Sentence
ar: الجملة السابقة
ja: 前の文
ko: 이전 문장
zh_hans: 上一句
zh_hant: 上一句

# process_by_char_length_explanation
source: Process by character length, suitable for Chinese, Japanese, etc.
ar: المعالجة حسب طول الحرف، مناسبة للصينية واليابانية وما إلى ذلك.
ja: 文字数で処理します。中国語や日本語などの連続したテキストに適しています。
ko: 글자 수로 처리합니다. 중국어, 일본어 등의 연속 텍스트에 적합합니다.
zh_hans: 按字符长度处理，适合中文、日文等连续型文本。
zh_hant: 按字元長度處理，適合中文、日文等連續型文本。

# process_by_spaces_explanation
source: Identify words by spaces, will not cut off words during line wrap.
ar: التعرف على الكلمات بالمسافات، ولن يتم قطع الكلمات عند التفاف السطر.
ja: スペースで単語を識別します。改行時に単語を途中で切りません。
ko: 공백으로 단어를 식별합니다. 줄바꿈 시 단어가 끊어지지 않습니다.
zh_hans: 按空格识别单词，换行时不会切断单词。
zh_hant: 按空格識別單詞，換行時不會切斷單詞。

source: Progress
ar: التقدم
ja: 進捗
ko: 진행률
zh_hans: 进度
zh_hant: 進度

source: Project
ar: مشروع
ja: プロジェクト
ko: 프로젝트
zh_hans: 工程
zh_hant: 工程

source: Project File Operations
ar: عمليات ملف المشروع
ja: プロジェクトファイル操作
ko: 프로젝트 파일 작업
zh_hans: 工程文件操作
zh_hant: 工程檔案操作

# prores_coding_explanation
source: ProRes uses Apple's fixed intermediate coding parameters, suitable for editing or archiving; bitrate depends on specs and size.
ar: يستخدم ProRes معلمات ترميز متوسطة ثابتة من Apple، مناسبة للتحرير أو الأرشفة؛ يعتمد معدل البت على المواصفات والحجم.
ja: ProResはAppleの固定中間エンコーディングパラメータを使用し、編集や高品質アーカイブに適しています。ビットレートは仕様とサイズによります。
ko: ProRes는 Apple의 고정 중간 인코딩 매개변수를 사용하므로 편집이나 보관에 적합합니다. 비트레이트는 사양과 해상도에 따릅니다.
zh_hans: ProRes 使用 Apple 固定的中间片编码参数，适合继续剪辑或高质量归档；码率由 ProRes 规格和画面尺寸决定。
zh_hant: ProRes 使用 Apple 固定的中間片編碼參數，適合繼續剪輯或高品質歸檔；碼率由 ProRes 規格和畫面尺寸決定。

source: Quality
ar: الجودة
ja: 品質
ko: 품질
zh_hans: 质量
zh_hant: 質量

source: Quick Creation & Slap Tool
ar: أداة الإنشاء السريع والضرب
ja: クイック作成・ビートツール
ko: 빠른 생성 및 비트 도구
zh_hans: 快速创建与拍打工具
zh_hant: 快速建立與拍打工具

source: Quiet Vocals (No Processing)
ar: صوت هادئ (بدون معالجة)
ja: 静かなボーカル (処理なし)
ko: 조용한 보컬 (처리 안 함)
zh_hans: 安静人声 (不处理)
zh_hant: 安靜人聲 (不處理)

source: Recent Projects
ar: المشاريع الأخيرة
ja: 最近のプロジェクト
ko: 최근 프로젝트
zh_hans: 最近项目
zh_hant: 最近專案

source: Recognition Language
ar: لغة التعرف
ja: 認識言語
ko: 인식 언어
zh_hans: 识别语言
zh_hant: 識別語言

# recommend_specific_language_explanation
source: Recommended to select a specific language for optimized results.
ar: يوصى بتحديد لغة معينة للحصول على نتائج محسنة.
ja: 最適化された結果を得るために、特定の言語を選択することをお勧めします。
ko: 최적화된 결과를 위해 특정 언어를 선택하는 것이 좋습니다.
zh_hans: 推荐选择特定的语言以获得针对该语种特别优化过的生成效果；如不确定可选择“自动检测”。
zh_hant: 推薦選擇特定的語言以獲得針對該語種特別優化過的生成效果；如不確定可選擇「自動檢測」。

source: Redo
ar: إعادة
ja: やり直す
ko: 다시 실행
zh_hans: 重做
zh_hant: 重做

source: Reference Area
ar: منطقة المرجع
ja: 参照領域
ko: 참조 영역
zh_hans: 参考区域
zh_hant: 參考區域

source: Reference Lyrics (Optional)
ar: الكلمات المرجعية (اختياري)
ja: 参考歌詞（オプション）
ko: 참고 가사 (선택 사항)
zh_hans: 参考歌词（可选）
zh_hant: 參考歌詞（可選）

source: Remote File Loading Tip
ar: تلميح تحميل الملفات عن بعد
ja: リモートファイル読み込みのヒント
ko: 원격 파일 로드 팁
zh_hans: 远程文件加载提示
zh_hant: 遠端檔案載入提示

source: Remove from List
ar: إزالة من القائمة
ja: リストから削除
ko: 목록에서 제거
zh_hans: 从列表移除
zh_hant: 從列表移除

# remove_from_recent_projects_confirm
source: Remove from recent projects?
ar: إزالة من المشاريع الأخيرة؟
ja: 最近のプロジェクトから削除しますか？
ko: 최근 프로젝트에서 제거할까요?
zh_hans: 从最近项目移除？
zh_hant: 從最近項目移除？

# replace_media_ellipsis
source: Replace Media…
ar: استبدال الوسائط…
ja: メディアを置き換え…
ko: 미디어 교체…
zh_hans: 替换媒体…
zh_hant: 替換媒體…

# replace_video_ellipsis
source: Replace Video…
ar: استبدال الفيديو…
ja: ビデオを置換…
ko: 비디오 교체…
zh_hans: 替换视频…
zh_hant: 替換視訊…

source: Representative Color
ar: اللون التمثيلي
ja: 代表色
ko: 대표 색상
zh_hans: 代表颜色
zh_hant: 代表顏色

# restore_current_preset_saved_values
source: Restore saved values of current preset
ar: استعادة القيم المحفوظة للوضع المسبق الحالي
ja: 現在のプリセットの保存値を復元
ko: 현재 프리셋의 저장된 값 복원
zh_hans: 恢复当前 preset 的已保存值
zh_hant: 恢復當前 preset 的已保存值

source: Restore Defaults
ar: استعادة الافتراضي
ja: デフォルトに戻す
ko: 기본값 복원
zh_hans: 恢复默认
zh_hant: 恢復預設

source: Restore Position
ar: استعادة الموضع
ja: 位置を復元
ko: 위치 복원
zh_hans: 恢复位置
zh_hant: 恢復位置

# resume_editing_position_confirm
source: Resume editing from last position?
ar: استئناف التحرير من الموضع الأخير؟
ja: 最後の編集位置から再開しますか？
ko: 이전 편집 위치에서 재개할까요?
zh_hans: 是否回到上次编辑位置？
zh_hant: 是否回到上次編輯位置？

# return_key_save_and_next
source: Return to save and next
ar: Return للحفظ والجملة التالية
ja: Returnで保存して次の文へ
ko: Return 저장 및 다음 문장
zh_hans: Return 保存并下一句
zh_hant: Return 儲存並下一句

source: Return to Document List
ar: العودة إلى قائمة المستندات
ja: ドキュメントリストに戻る
ko: 문서 목록으로 돌아가기
zh_hans: 返回文稿列表
zh_hant: 返回文稿列表

source: Right Half
ar: النصف الأيمن
ja: 右半分
ko: 우측 절반
zh_hans: 右半
zh_hant: 右半

source: Role
ar: الدور
ja: 役割
ko: 역할
zh_hans: 角色
zh_hant: 角色

# safe_area_legend
source: Orange dashed: Action Safe 3.5% · Red solid: Title Safe 5%
ar: خط برتقالي متقطع: المنطقة الآمنة للعمل 3.5٪ · خط أحمر متصل: المنطقة الآمنة للعنوان 5٪
ja: オレンジ点線：アクションセーフ3.5% ・ 赤実線：タイトルセーフ5%
ko: 주황색 점선: 액션 세이프 3.5% · 빨간색 실선: 타이틀 세이프 5%
zh_hans: 橙色虚线：动作安全 3.5% · 红色实线：图文安全 5%
zh_hant: 橙色虛線：動作安全 3.5% · 紅色實線：圖文安全 5%

source: Save
ar: حفظ
ja: 保存
ko: 저장
zh_hans: 保存
zh_hant: 儲存

# save_and_next_sentence
source: Save and Next
ar: حفظ والجملة التالية
ja: 保存して次の文へ
ko: 저장 및 다음 문장
zh_hans: 保存并下一句
zh_hant: 儲存並下一句

source: Save As...
ar: حفظ باسم...
ja: 名前を付けて保存...
ko: 다른 이름으로 저장...
zh_hans: 另存为...
zh_hant: 另存為...

source: Save current project file
ar: حفظ ملف المشروع الحالي
ja: 現在のプロジェクトファイルを保存
ko: 현재 프로젝트 파일 저장
zh_hans: 保存当前工程文件
zh_hant: 儲存當前工程檔案

source: Save “%@” Project?
ar: هل تريد حفظ مشروع "%@"؟
ja: 「%@」プロジェクトを保存しますか？
ko: "%@" 프로젝트를 저장하시겠습니까?
zh_hans: 是否保存“%@”工程？
zh_hant: 是否儲存“%@”工程？

# scanning_system_fonts
source: Scanning system fonts and language packs...
ar: مسح خطوط النظام وحزم اللغات...
ja: システムフォントと言語パックをスキャンしています...
ko: 시스템 글꼴 및 언어 팩 검색 중...
zh_hans: 正在扫描系统字体与语言包...
zh_hant: 正在掃描系統字型與語言包...

source: Script
ar: النص
ja: スクリプト
ko: 스크립트
zh_hans: 文稿
zh_hant: 文稿

# search_fonts_placeholder
source: Search Fonts (En/Zh)...
ar: البحث عن الخطوط (عربي/إنجليزي)...
ja: フォントを検索（日英）...
ko: 폰트 검색 (한/영)...
zh_hans: 搜索字体（中英文）...
zh_hant: 搜尋字型（中英文）...

source: Select All in Group
ar: تحديد الكل في المجموعة
ja: グループ内をすべて選択
ko: 그룹 내 전체 선택
zh_hans: 选择同组全部
zh_hant: 選擇同組全部

# select_all_subtitles_in_this
source: Select all subtitles in this group
ar: تحديد كافة ترجمات هذه المجموعة
ja: このグループのすべての字幕を選択
ko: 이 그룹의 모든 자막 선택
zh_hans: 选择此组全部字幕
zh_hant: 選擇此組全部字幕

source: Select Font
ar: تحديد الخط
ja: フォントを選択
ko: 글꼴 선택
zh_hans: 选择字体
zh_hant: 選擇字型

# select_hard_subtitle_rendering_font
source: Select hard subtitle rendering font; the same font name will be used to generate subtitle bitmaps when exporting.
ar: اختر خط عرض الترجمة المدمجة؛ عند التصدير، سيتم استخدام نفس اسم الخط لتوليد خريطة بت الترجمة
ja: ハード字幕レンダリング用フォントを選択します。エクスポート時には同じフォント名を使用して字幕ビットマップが生成されます。
ko: 하드 자막 렌더링 글꼴을 선택하십시오. 내보낼 때 동일한 글꼴 이름을 사용하여 자막 비트맵을 생성합니다.
zh_hans: 选择硬字幕渲染字体；导出时会使用同一字体名生成字幕位图
zh_hant: 選擇硬字幕渲染字體；導出時會使用同一字體名生成字幕位圖

# select_original_group_hint
source: Please select the original text group containing subtitles.
ar: يرجى تحديد مجموعة النص الأصلي التي تحتوي على الترجمة.
ja: 字幕が含まれる原文グループを選択してください。
ko: 자막이 포함된 원본 그룹을 선택하십시오.
zh_hans: 请选择包含字幕的原文小组。
zh_hant: 請選擇包含字幕的原文小組。

source: Select Recognition Method
ar: تحديد طريقة التعرف
ja: 認識方法を選択
ko: 인식 방식 선택
zh_hans: 选择识别方式
zh_hant: 選擇識別方式

source: Select Storage Directory
ar: اختر دليل التخزين
ja: 保存ディレクトリを選択
ko: 저장 디렉터리 선택
zh_hans: 选择存储目录
zh_hant: 選擇儲存目錄

source: Select .strophe file
ar: تحديد ملف .strophe
ja: .stropheファイルを選択
ko: .strophe 파일 선택
zh_hans: 选择 .strophe 文件
zh_hant: 選擇 .strophe 檔案

# select_subtitle_blocks_first_hint
source: Please select the subtitle blocks to translate in text editor or timeline first.
ar: يرجى تحديد كتل الترجمة التي تريد ترجمتها في محرر النصوص أو الخط الزمني أولاً.
ja: まずテキストエディタまたはタイムラインで翻訳する字幕ブロックを選択してください。
ko: 먼저 텍스트 편집기나 타임라인에서 번역할 자막 블록을 선택하십시오.
zh_hans: 请先在文稿或时间轴中选择要转换的字幕块。
zh_hant: 請先在文稿或時間軸中選擇要轉換的字幕塊。

source: Selected
ar: محدد
ja: 選択済み
ko: 선택됨
zh_hans: 已选择
zh_hant: 已選擇

# selecting_an_external_hard_drive
source: Selecting an external hard drive saves built-in SSD space; downloaded models will be written directly to that directory.
ar: يؤدي اختيار قرص صلب خارجي إلى توفير مساحة SSD الداخلية، وسيتم كتابة النموذج مباشرة في ذلك المجلد عند التنزيل.
ja: 外付けハードディスクを選択すると、内蔵SSDの容量を節約できます。ダウンロード時にモデルはそのディレクトリに直接書き込まれます。
ko: 외장 하드 드라이브를 선택하면 내장 SSD 공간을 절약할 수 있으며, 다운로드 시 모델이 해당 디렉터리에 직접 저장됩니다.
zh_hans: 选择外置硬盘可节省内置 SSD 空间，下载时模型会直接写入该目录。
zh_hant: 選擇外置硬碟可節省內置 SSD 空間，下載時模型會直接寫入該目錄。

source: Selection Tool
ar: أداة الاختيار
ja: 選択ツール
ko: 선택 도구
zh_hans: 选择工具
zh_hant: 選取工具

source: Server Address
ar: عنوان الخادم
ja: サーバーアドレス
ko: 서버 주소
zh_hans: 服务地址
zh_hant: 服務地址

source: Set as active group
ar: تعيين كمجموعة نشطة
ja: アクティブグループに設定
ko: 활성 그룹으로 설정
zh_hans: 设为活动分组
zh_hant: 設為活動分組
